
var addresses = require('./addresses');

var result = [];

// ... some good code ...
for (var i = 0; i <addresses.length; i++ ){
    var arr =(addresses[i].replace(/ул.|пр-т.|пл.|кв.|дом|\/|\,/g, "#")).split('#');

     for (var j = 0; j < arr.length; j++ ) {
         var temp = [];
         if ((arr[j] == '') || (arr[j] == ' ')) {
             continue;
         }
         else {
             temp.push(arr[j]);
        }
     }
      var  user = {
          street:  temp[0],
          house: temp[1],
          flat: temp[2]
      };
      result.push(user);

}
console.log(result);

/*

 потрібно розпарсити адреси які містяться у файлі addresses.js
 адреси зберігаються в масиві а вигляді рядків, в наступному форматі:
 - початок та цінець рядка може мати пробіли*
 - перед назвою вулиці може бути приставка "ул." або "пр-т."
 - між назвою вулиці та приставкою може бути пробіл*
 - після назви вулиці може бути кома
 - далі йде необов'язкова приставка "дом"
 - номер будинку може містити великі та маленькі бакви кирилиці, цифри від 0 до 9, дефіз та "/"
 - формат запису номеру будинку та квартири "25-А, кв. 5", або "30/4", або тыльки будинок без квартири
 - крапок у приставках "вул.",  "пр-т." може і не бути
 - всі слова у рядку можуть розділятися пробілами*
 результатом повинен бути масив об'єктів, наступного формату
 {
 "street": "",
 "house": "",
 "flat": ""
 }
 індекс рядка у вхідному масиві, повинен повинен співпадати з індексом об'єкта
 файл regexpHomeTask.js запускати за бопомогою ноди
 $ node regexpHomeTask.js
 пысля того, як ви виконаєте завдання, змініть назву файлу regexpHomeTask.js на
 {ваш номерв журналі}.js та вишліть мені на пошту maksym.zhuk@ria.com,
 вказавши тему "Регулярні вирази. Домашнє завдання."
 Файл {ваш номерв журналі}.js повинен експортити готові результати методом module.exports = results
 так як, під час перевірки ДЗ я буду реквайрити ваші файли і порівнювати результати зі своїми.
 Можете заробити собі додатковий плюс, якщо вишлете не файл, а ссилку на Git репозиторій, з виконаним домашнім завданням.
 завдання подрібно вислати до 29.03 23:59
 приклад структури масиву result
 >>> result
 [
 ...
 {
 "street": 'Юности', //string
 "house": '25',      //string
 "flat": '6'         //string
 }
 ...
 ]
 */

module.exports = result;

